const fa = {
	about: {
		header: 'سلام، من آرین هستم.',
		info: 'من مهندس نرم‌افزار و توسعه‌دهنده فول‌استک جاوااسکریپت هستم. بیش از {{year}} سال تجربه در زمینه توسعه وب دارم. از ترکیب ایده‌های جدید با برنامه‌نویسی، کدنویسی در مسیر تحقق آن‌ها و حل مسائل لذت می‌برم. همیشه تلاش می‌کنم طراحی‌های جدید و منحصربه‌فردی خلق کنم. می‌توانید برخی از کارهایم را در بخش پروژه‌ها مشاهده کنید.',
		exp: [
			{
				title: 'کارشناسی ارشد مهندسی نرم‌افزار',
				text: 'دانشگاه شیراز',
			},
			{
				title: 'کارشناسی مهندسی کامپیوتر',
				text: 'دانشگاه فسا - دانشجوی ممتاز',
			},
			{
				title: 'فریلنسر',
				text: 'شیراز - توسعه‌دهنده وب',
			},
			{
				title: 'شرکت isDynamic',
				text: 'شیراز - توسعه‌دهنده وب',
			},
			{
				title: 'شرکت Magneo GmbH',
				text: 'سوئیس - توسعه‌دهنده وب',
			},
			{
				title: 'شرکت رایان تجارت پارس',
				text: 'شیراز - توسعه‌دهنده وب',
			},
			{
				title: 'شرکت بیمه ایران',
				text: 'شیراز - اپراتور کامپیوتر',
			},
		],
	},
	projects: [
		{
			info: 'وب‌سایت پورتفولیو سه‌بعدی',
			text: 'یک وب‌سایت کاملاً سه‌بعدی و منحصربه‌فرد که از ترکیب قدرت Blender و Three.js برای خلق صحنه‌ای تعاملی با انیمیشن‌های جذاب استفاده می‌کند. مدل‌های سه‌بعدی و انیمیشن‌ها در Blender ساخته شده و با کتابخانه قدرتمند GSAP کنترل می‌شوند. برای استایل‌دهی از فریم‌ورک Tailwind CSS استفاده شده و در نهایت، تمامی این اجزا با React Three.js پیاده‌سازی و یکپارچه شده‌اند.',
		},
		{
			info: 'اپلیکیشن کامل TMDB API',
			text: 'یک اپلیکیشن پایگاه داده فیلم و سریال برای جستجو و نمایش تمامی اطلاعات با استفاده از TMDB API. این پروژه با Svelte.js و Tailwind CSS توسعه داده شده است.',
		},
		{
			info: 'اپلیکیشن آب و هوا',
			text: 'یک اپلیکیشن پیشرفته آب و هوا با پشتیبانی از نقشه برای انتخاب دستی موقعیت مکانی یا دسترسی به موقعیت فعلی، جهت دریافت پیش‌بینی آب و هوا همراه با انیمیشن‌های روان و جذاب.',
		},
		{
			info: 'طراح تی‌شرت',
			text: 'یک طراح تی‌شرت که با Three.js ساخته شده است. قابلیت تغییر رنگ، آپلود تصاویر دلخواه برای استفاده به عنوان لوگو یا بافت (Texture) کامل و تنظیم لوگو؛ همه این امکانات برای طراحی تی‌شرت اختصاصی شما و ذخیره آن فراهم شده است.',
		},
		{
			info: 'اپلیکیشن کامل OMDB API',
			text: 'یک اپلیکیشن پایگاه داده فیلم برای نمایش و افزودن فیلم‌ها و سریال‌ها با استفاده از OMDB API. این پروژه یک اپلیکیشن کاملاً SSR است که با Express، موتور قالب‌ساز EJS و استایل‌دهی Tailwind CSS توسعه یافته است.',
		},
		{
			info: 'وب‌سایت اسکرول پارالاکس',
			text: 'یک وب‌سایت فول‌استک پارالاکس که با اسکرول کاربر کار می‌کند. فرانت‌اند با React و CSS خالص توسعه یافته و بک‌اند با Express، کتابخانه Sequelize به عنوان ORM و دیتابیس MySQL پیاده‌سازی شده است.',
		},
		{
			info: 'تحلیل‌گر لغوی مبتنی بر DFA',
			text: 'یک تحلیل‌گر لغوی (Lexical Analyzer) توسعه‌یافته با پایتون که می‌تواند در ساخت کامپایلر مورد استفاده قرار گیرد. این برنامه متن ورودی را دریافت کرده و بر اساس DFA تعریف‌شده، آن را به توکن‌ها تبدیل (Tokenize) می‌کند و برای مرحله بعدی کامپایلر آماده می‌سازد. همچنین دارای یک رابط کاربری گرافیکی (GUI) است که با Tkinter ساخته شده است.',
		},
		{
			info: 'پردازش تصویر با React و OpenCV',
			text: 'یک ابزار پردازش تصویر با استفاده از کتابخانه OpenCV که با React.js و Tailwind CSS توسعه داده شده است و انواع مختلفی از تبدیل‌ها و پردازش‌های تصویری را انجام می‌دهد.',
		},
		{
			info: 'منوی چندپلتفرمی',
			text: 'یک اپلیکیشن منوی فست‌فود که با React Native ساخته شده است. این پروژه با یک پایگاه کد واحد (Single Codebase)، در سه نسخه برای اندروید، iOS و وب منتشر شده است.',
		},
		{
			info: 'وب‌سایت با HTML، CSS و JS خالص',
			text: 'وب‌سایتی که با HTML، CSS و جاوااسکریپت خالص (Vanilla JS) توسعه داده شده است؛ همراه با افکت دنباله‌روی موس (Trailing Mouse Effect) که با جاوااسکریپت پیاده‌سازی شده است.',
		},
		{
			info: 'تبدیل عدد اعشاری به ۱۶-۳۲-۶۴ بیت',
			text: 'این برنامه که با C++ توسعه یافته، از استاندارد IEEE 754 برای تبدیل عدد اعشاری ورودی به دقت نیمه (۱۶ بیت - Half-Precision)، دقت تک (۳۲ بیت - Single-Precision) و دقت مضاعف (۶۴ بیت - Double-Precision) استفاده می‌کند.',
		},
		{
			info: 'بازی چندپلتفرمی',
			text: 'یک بازی چندپلتفرمی که با React Native ساخته شده است. این پروژه با یک پایگاه کد واحد، در سه نسخه برای اندروید، iOS و وب منتشر شده است.',
		},
		{
			info: 'روش خوشه‌بندی داده‌ها',
			text: 'این برنامه متلب (MATLAB) از الگوریتم معروف k-means برای قرار دادن داده‌های ورودی در بهترین خوشه‌های ممکن استفاده می‌کند. نتایج به صورت نمودار و اشکال گرافیکی نمایش داده می‌شوند.',
		},
		{
			info: 'ساده‌کننده معادلات',
			text: 'این برنامه که با C++ توسعه یافته، از روش کواین-مک‌کلاسکی (Quine-McCluskey) برای ساده‌سازی معادلات منطقی (بولی) ورودی استفاده می‌کند و تا ۱۰ متغیر را پشتیبانی می‌کند.',
		},
		{
			info: 'فرمت‌های R، I و S',
			text: 'این برنامه C++ کد RISC-V را به عنوان ورودی دریافت کرده و کد ماشین (Machine Code) آن را به عنوان خروجی محاسبه می‌کند. فرمت‌های R، I و S در معماری RISC-V پشتیبانی می‌شوند.',
		},
		{
			info: 'کلون وب‌سایت',
			text: 'نسخه شبیه‌سازی‌شده (کلون) وب‌سایت رسمی مرسدس بنز که با HTML و CSS خالص توسعه داده شده است.',
		},
		{
			info: 'تبدیل عدد دهدهی <> رومی',
			text: 'این برنامه C++ اعداد دهدهی (اعشاری) را به اعداد رومی و بالعکس تبدیل می‌کند.',
		},
	],
	menu: {
		about: 'درباره من',
		projects: 'پروژه‌ها',
		musics: 'موسیقی',
		skills: 'مهارت‌ها',
		exp: 'تجربیات',
		playing: 'در حال پخش',
		paused: 'متوقف‌شده',
		title1: 'مهندس نرم‌افزار',
		title2: 'توسعه‌دهنده فول‌استک',
		greet1: 'سلام، من آرین هستم!',
		greet2: 'به پورتفولیو سه‌بعدی من خوش آمدید',
		loading: 'چند لحظه صبر کنید، در حال بارگذاری مدل سه‌بعدی...',
		start: 'شروع',
	},
} as const

export default fa
